In [ ]:
select * from data
limit 10;

In [ ]:
# left join
select * from table_a as a
left join table_b as b
on b.id = a.id
left join table_c as c
on c.id = a.id

In [ ]:
SELECT COUNT(DISTINCT user_id) AS enrollments,
    COUNT(CASE
        WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) AS march_cancellations,
    
     ROUND(100.0 * COUNT(CASE
        WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) / COUNT(DISTINCT user_id)) AS churn_rate
        
FROM pro_users
WHERE signup_date < '2017-04-01'
    AND(
    (cancel_date IS NULL) OR
    (cancel_date > '2017-03-01')
  );

In [ ]:
# Aggregation

SELECT sources,
    COUNT(DISTINCT id) AS num_users
FROM page_visits
GROUP BY sources
ORDER BY num_users DESC;

### all variables

In [ ]:
select * from news;

In [ ]:
"""
common variable types in SQL

1. INTEGER
2. TEXT
3. DATE
4. REAL
"""

### create celebs table with 3 variable

In [ ]:
CREATE TABLE celebs (
   id INTEGER, 
   name TEXT, 
   age INTEGER
   height REAL
   birth day DATE
);

### creating table with contraints

In [ ]:
CREATE TABLE awards (
   id INTEGER PRIMARY KEY,
   recipient TEXT NOT NULL,
   award_name TEXT DEFAULT 'Grammy'
);

### insert new row

In [ ]:
INSERT INTO celebs (id, name, age) 
VALUES (1, 'Justin Bieber', 22);

### insert new column

In [ ]:
ALTER TABLE celebs 
ADD COLUMN twitter_handle TEXT;

### update a row

In [ ]:
UPDATE celebs 
SET twitter_handle = '@taylorswift13' 
WHERE id = 4;

### delete rows

In [ ]:
DELETE FROM celebs 
WHERE twitter_handle IS NULL;

# Query data

In [ ]:
select * from data;

In [ ]:
select year, name form data;

In [ ]:
select distinct year from data;

In [ ]:
select name from data
where age > 25;

In [ ]:
select * from movies
where name like "go_en" # any letter in _

In [ ]:
select * from movies
where name like "S%"

In [ ]:
select * from data
where name like "%P"

In [ ]:
select * from data
where name like "%peter%"

In [ ]:
# selecting rows that do not contain the word "box" in name column
select * from data
where name not like "%box%";

In [ ]:
# finding missing values
select * from data
where grade is null;

In [ ]:
# between clause
"""
Using the BETWEEN operator, write a query that selects all information about 
data whose name begins with the letters ‘D’, ‘E’, and ‘F’.

"""
select * from data
where name between "D" and "G";

In [ ]:
# and clause

select * from data
where year between 1970 and 1979 and grade > 3;

select * from aata
where year < 1985 and class = "primary";

In [ ]:
# or clause

select * from data
where year > 2010 or genre = "action";

select * from movies 
where genre = "thriller" or genre = "comedy";

In [ ]:
# order by

select * from data
where year > 2010
order by grade desc;

In [ ]:
# creating new column using case statement (similar to if-else statement)

select name,
    case
        when year < 1980 then "eights"
        when year < 1990 then "ninetys"
        else "other"
    end as "millenium"
from data;


select name,
    case
        when review > 7.5 then "very good"
        when review > 6 then "good"
        when review > 4 then "average"
        when review >= 0 then "bad"
    end as "status"
from data;

# Aggregation

In [ ]:
# count
select count(id)
from data;

In [ ]:
# sum
select sum(salary)
from data;

In [ ]:
# max & min
select max(price)
from data;

select min(grade)
from data;

In [ ]:
# average
select avg(grade)
from data

In [ ]:
# rouding the number
select name, round(price,2) 
from data;

In [ ]:
# group by
select 
    gender, 
    avg(salary)
from data
group by gender;

In [ ]:
# having

"""
When we want to limit the results of a query based on values of the individual rows, use WHERE.
When we want to limit the results of a query based on an aggregated property, use HAVING.
"""
select 
    grade,
    avg(marks)
from data
group by grade
having count(grade) > 10;